// 中国手机号正则表达式
// 目前主要号段：
// 移动：134-139, 147, 150-152, 157-159, 172, 178, 182-184, 187-188, 195, 198
// 联通：130-132, 145, 155-156, 166, 171, 175-176, 185-186, 196
// 电信：133, 149, 153, 173-174, 177, 180-181, 189, 190-191, 193, 199
// 虚拟运营商：170, 162
export const vaildateMoible = (mobile: string) => {
  const mobilePattern = /^1(3[0-9]|4[5-9]|5[0-35-9]|6[2-6]|7[0-8]|8[0-9]|9[0-35-9])\d{8}$/
  if (!mobilePattern.test(mobile.trim())) {
    uni.showToast({
      title: '电话不符合规范',
      icon: 'error',
    })
    return false
  }
  return true
}
